// マップ元データ
/*
 0 = 道
 1 = 壁横
 2 = 壁縦
 3 = 柵
 4 = 縦柵
 5 = 横柵
 15 = ブロック
 16 = 鍵ドア
 20 = 草1
 20 = 草2
 22 = 階段
 23 = ポイント
 24 = 鍵
 */
int[][] mymap1 = {

  { 0, 0, 0, 0, 0, 0, 0, 0, 20, 0 }, 
  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, 
  { 0, 20, 0, 0, 0, 0, 0, 0, 0, 0 }, 
  { 0, 0, 0, 0, 0, 0, 21, 0, 0, 0 }, 
  { 2, 1, 1, 1, 1, 1, 1, 1, 1, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 22, 2 }, 
  { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }, 
  { 0, 0, 0, 21, 0, 0, 0, 0, 0, 0 }, 
  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 21 }, 
  { 0, 0, 0, 0, 0, 20, 0, 0, 0, 0 }

};


int[][] mymap2 = {

  { 2, 1, 1, 1, 1, 1, 1, 1, 1, 2 }, 
  { 2, 0, 20, 0, 0, 0, 0, 23, 0, 2}, 
  { 2, 1, 0, 1, 1, 1, 0, 0, 0, 2 }, 
  { 2, 0, 0, 2, 0, 2, 0, 2, 0, 2 }, 
  { 2, 0, 1, 1, 0, 1, 1, 1, 0, 2 }, 
  { 2, 0, 2, 0, 0, 0, 2, 0, 0, 2 }, 
  { 2, 0, 2, 22, 2, 0, 2, 0, 1, 2 }, 
  { 2, 0, 1, 1, 1, 16, 2, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 2, 2, 24, 2 }, 
  { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }

};

int[][] mymap3 = {

  { 2, 1, 1, 1, 1, 1, 1, 1, 1, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 2, 0, 0, 0, 0, 0, 0, 0, 0, 2 }, 
  { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }

};

class MapChip {
  //集合画像本体
  PImage mapChipArray;
  //マップチップの総数、並びの幅、縦の数
  int mCount, mWidth, mHeight;

  //コンストラクタには集合画像のファイル名を与える
  MapChip(String file) {
    mapChipArray=loadImage(file);
    mWidth=mapChipArray.width/Chip_w; //画像に含まれるマップチップの横並び数 
    mHeight=mapChipArray.height/Chip_h; //マップチップの縦の数 
    mCount=mWidth * mHeight; //画像に含まれるマップチップの総数
  }    
  //「番号」を与えて画像を得る
  //マップチップ総数を超えたらnullになる
  PImage getMapChip(int number) {
    if (number>=mCount) {
      return null;
    }
    //「番号」から画像の位置を求める
    int w=(number % mHeight)*Chip_w;
    int h=(number / mWidth)*Chip_h;
    return mapChipArray.get( w, h, Chip_w, Chip_h);//PImage::get()で画像を切り出す
  }
}
